using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace CoachHussien.Application.Migrations
{
    /// <inheritdoc />
    public partial class InitialDB : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "FoodCategories",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Name = table.Column<string>(type: "nvarchar(max)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_FoodCategories", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Foods",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Name = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    Calories = table.Column<decimal>(type: "decimal(18,2)", nullable: false),
                    Protein = table.Column<decimal>(type: "decimal(18,2)", nullable: false),
                    Carbs = table.Column<decimal>(type: "decimal(18,2)", nullable: false),
                    Fat = table.Column<decimal>(type: "decimal(18,2)", nullable: false),
                    CategoryId = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Foods", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Foods_FoodCategories_CategoryId",
                        column: x => x.CategoryId,
                        principalTable: "FoodCategories",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.InsertData(
                table: "FoodCategories",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Protein" },
                    { 2, "Carbohydrates" },
                    { 3, "Fats" }
                });

            migrationBuilder.InsertData(
                table: "Foods",
                columns: new[] { "Id", "Calories", "Carbs", "CategoryId", "Fat", "Name", "Protein" },
                values: new object[,]
                {
                    { 1, 35m, 5.2m, 1, 0.1m, "لبن خالي الدسم (لامار)", 3.3m },
                    { 2, 42m, 3.8m, 1, 1.5m, "لبن صويا", 2.5m },
                    { 3, 50m, 3.61m, 1, 0.2m, "زبادي يوناني ساده (جهينة)", 8.33m },
                    { 4, 51m, 5m, 1, 1.5m, "زبادي لايت (جهينة)", 3.4m },
                    { 5, 57m, 4.5m, 1, 3m, "لبن خالي من اللاكتوز (جهينة)", 3m },
                    { 6, 63m, 5m, 1, 3.4m, "لبن كامل الدسم", 3.2m },
                    { 7, 82m, 2.9m, 1, 9.2m, "توفو", 3.6m },
                    { 8, 91m, 2.8m, 1, 3.5m, "جبنة قريش", 12m },
                    { 9, 99m, 0.2m, 1, 0.3m, "جمبري", 24m },
                    { 10, 100m, 10m, 1, 10m, "شرائح دجاج (أطياب)", 15m },
                    { 11, 102.7m, 0.3m, 1, 19m, "بسطرمة", 2.8m },
                    { 12, 103m, 1m, 1, 0m, "تونة لايت (صن شاين)", 23m },
                    { 13, 106m, 6m, 1, 0m, "بييكون (مخلي من الدهون)", 18m },
                    { 14, 116m, 0m, 1, 0.8m, "تونة لايت (فيشر مان)", 25.5m },
                    { 15, 118m, 0m, 1, 1.3m, "سمك هامور (بعد الطهي)", 24.8m },
                    { 16, 124m, 0m, 1, 2.6m, "سمك قاروص (بعد الطهي)", 23.6m },
                    { 17, 128m, 0m, 1, 2.6m, "سمك بلطي (بعد الطهي)", 26.2m },
                    { 18, 131m, 5m, 1, 7m, "جبنة فيتا لايت (بريزيدون)", 12m },
                    { 19, 135m, 0m, 1, 3.5m, "سمك دنيس (بعد الطهي)", 24.2m },
                    { 20, 138m, 14m, 1, 1m, "قطع سيتان نباتي (Not Fried)", 19m },
                    { 21, 140m, 5m, 1, 8m, "جبنة لايت اسبريد (بريزيدون)", 12m },
                    { 22, 141m, 6.8m, 1, 6.7m, "سلطة تونة مكسيكية (فيشر مان)", 11.4m },
                    { 23, 149m, 0m, 1, 4.4m, "سلمون", 25.6m },
                    { 24, 149m, 13m, 1, 1m, "شرائح دجاج نباتي (Not Fried)", 20m },
                    { 25, 150m, 0m, 1, 4.9m, "سمك بوري (بعد الطهي)", 24.8m },
                    { 26, 153m, 0m, 1, 4.5m, "لحمة مفرومة (متشفية من غير دهون)", 26.4m },
                    { 27, 153m, 4.3m, 1, 12m, "جبنة فلاديفيا لايت", 6m },
                    { 28, 160m, 0m, 1, 4.5m, "ستيك لحمة", 29.9m },
                    { 29, 165m, 0m, 1, 3.6m, "صدور دجاج (بعد الطهي)", 31m },
                    { 30, 167m, 0.7m, 1, 6.5m, "كبدة دجاج (بعد الطهي)", 24.5m },
                    { 31, 170m, 2m, 1, 5m, "فصوص تركي", 29.29m },
                    { 32, 170m, 0m, 1, 6m, "روست بيف", 29m },
                    { 33, 187m, 0m, 1, 6.63m, "مكعبات لحمة حمراء (بعد الطهي)", 29.81m },
                    { 34, 191m, 5.1m, 1, 5.3m, "كبدة بقري (بعد الطهي)", 29.1m },
                    { 35, 195m, 0m, 1, 10.4m, "سردين", 25.3m },
                    { 36, 211m, 14.68m, 1, 13.26m, "كرات لحم نباتي (Las Vegan)", 11.12m },
                    { 37, 218m, 39m, 1, 1m, "كفتة عدس نباتي (Not Fried)", 15m },
                    { 38, 230m, 9m, 1, 17m, "لحمة مفرومة نباتي (Las Vegan)", 13m },
                    { 39, 235m, 0m, 1, 11.6m, "جبنة جودا لايت", 31m },
                    { 40, 265m, 3.9m, 1, 21.5m, "جبنة فيتا لايت (المراعي)", 14.2m },
                    { 41, 284m, 9m, 1, 24m, "جبنة مثلثات (بريزيدون)", 8m },
                    { 42, 262m, 8m, 1, 19.8m, "جبنة شرائح برجر (بريزيدون)", 13m },
                    { 43, 308m, 6.7m, 1, 19.1m, "جبنة موزاريلا لايت (بريزيدون)", 0m },
                    { 44, 311m, 1.7m, 1, 23.5m, "جبنة حلومي", 23.9m },
                    { 45, 318m, 2.28m, 1, 24.33m, "جبنة بيضاء عادية", 22.44m },
                    { 46, 318m, 2.5m, 1, 24.6m, "جبنة موزاريلا", 21.6m },
                    { 47, 363.64m, 12.12m, 1, 3.03m, "Egg White Protein", 69.7m },
                    { 48, 377m, 11.42m, 1, 11.4m, "أبوعوف بروتين بار (بندق)", 37.14m },
                    { 49, 387m, 3.6m, 1, 26.9m, "جبنة تركي", 31.8m },
                    { 50, 70m, 18.6m, 1, 0.2m, "جبنة بارميزان", 0.6m },
                    { 51, 53m, 3.6m, 1, 0.1m, "هاي برو (دانون)", 9.4m },
                    { 52, 55m, 2.4m, 1, 0.1m, "بياض بيض", 10.7m },
                    { 53, 58.2m, 5m, 1, 3m, "جهينة لبن رايب (220 مل)", 2.7m },
                    { 54, 120m, 3m, 1, 10m, "واي بروتين (Redcon Isorope)", 25m },
                    { 55, 195m, 8.5m, 1, 13m, "سلطة تونة (ريو ماري)", 10m },
                    { 56, 285m, 20m, 1, 23m, "جبنة موزاريلا نباتي (Violife)", 0m },
                    { 57, 366.7m, 0m, 1, 0m, "كازين", 86.7m },
                    { 58, 373m, 6m, 1, 2.5m, "واي بروتين", 77.1m },
                    { 59, 379m, 7.9m, 1, 3.2m, "أيزو واي (Anabolic)", 78.9m },
                    { 60, 388m, 4.5m, 1, 1m, "واي بروتين (Evolve)", 88m },
                    { 61, 403m, 3.4m, 1, 33.3m, "جبنة شيدر لايت شرائح (بريزيدون)", 22.9m },
                    { 62, 70m, 6.2m, 1, 3.1m, "زبادي كامل الدسم", 4.4m },
                    { 63, 155m, 1.1m, 1, 10.6m, "بيض كامل", 12.6m },
                    { 64, 340m, 4.9m, 1, 5.7m, "بروتين نباتي (ليمتليس)", 76.7m },
                    { 65, 15m, 3.63m, 2, 0.1m, "خيار", 0.65m },
                    { 66, 15m, 2.9m, 2, 0.1m, "خس", 1.4m },
                    { 67, 15m, 3.6m, 2, 0.1m, "خضار أخضر", 0.6m },
                    { 68, 15m, 1.3m, 2, 1m, "لبن لوز", 0.4m },
                    { 69, 17m, 3.1m, 2, 0.3m, "كوسة", 1.2m },
                    { 70, 18m, 3.9m, 2, 0.2m, "طماطم", 0.9m },
                    { 71, 20m, 3.9m, 2, 0.1m, "هليون", 2.2m },
                    { 72, 20m, 4.6m, 2, 0.2m, "فلفل أخضر بارد", 0.9m },
                    { 73, 22m, 3.3m, 2, 0.3m, "مشروم", 3.1m },
                    { 74, 22m, 4.5m, 2, 0.2m, "بامية (بعد الطهي)", 2m },
                    { 75, 23m, 3.6m, 2, 0.4m, "سبانخ", 2.9m },
                    { 76, 25m, 6m, 2, 0.2m, "باذنجان", 1m },
                    { 77, 25m, 3.6m, 2, 0.7m, "جرجير", 2.6m },
                    { 78, 25m, 5m, 2, 0.3m, "قرنبيط", 1.9m },
                    { 79, 26m, 6m, 2, 0.3m, "فلفل أحمر بارد", 1m },
                    { 80, 26.6m, 6.6m, 2, 0m, "صوص لايت (زيرو تريت)", 0m },
                    { 81, 27m, 5.7m, 2, 0.5m, "بصل أخضر", 1m },
                    { 82, 28.7m, 5.3m, 2, 0.3m, "صلصلة طماطم", 1.2m },
                    { 83, 30m, 7.6m, 2, 0.2m, "بطيخ", 0.6m },
                    { 84, 32m, 7.7m, 2, 0.3m, "فراولة", 0.7m },
                    { 85, 34m, 6.6m, 2, 0.4m, "بروكلي", 2.8m },
                    { 86, 34m, 8.2m, 2, 0.2m, "كانتلوب", 0.8m },
                    { 87, 35m, 7.9m, 2, 0.3m, "فاصوليا خضراء", 1.9m },
                    { 88, 39m, 9.5m, 2, 0.3m, "خوخ", 0.9m },
                    { 89, 40m, 9.3m, 2, 0.1m, "بصل", 1.1m },
                    { 90, 41m, 10m, 2, 0.2m, "جزر", 0.9m },
                    { 91, 42m, 6.5m, 2, 0.02m, "ملوخية", 1.7m },
                    { 92, 43m, 9.6m, 2, 0.2m, "بنجر", 1.6m },
                    { 93, 43m, 10m, 2, 0.5m, "توت أسود", 1.4m },
                    { 94, 45m, 9.7m, 2, 0.4m, "عصير برتقال فريش", 0.8m },
                    { 95, 46m, 10.7m, 2, 0.1m, "عصير تفاح فريش", 0.1m },
                    { 96, 47m, 12m, 2, 0.1m, "برتقال", 0.9m },
                    { 97, 47m, 12m, 2, 0.1m, "يوسفي", 0.9m },
                    { 98, 50m, 13.1m, 2, 0.1m, "أناناس", 0.5m },
                    { 99, 50m, 12m, 2, 0.3m, "كرز (أصفر)", 1m },
                    { 100, 52m, 14m, 2, 0.2m, "تفاح", 0.3m },
                    { 101, 52m, 11m, 2, 0.72m, "حرنكش", 2m },
                    { 102, 55m, 5.5m, 2, 2.1m, "لبن نص دسم", 3.4m },
                    { 103, 57m, 14.5m, 2, 0.3m, "توت أزرق", 0.7m },
                    { 104, 57m, 15.2m, 2, 0.1m, "كمثري", 0.4m },
                    { 105, 61m, 14.7m, 2, 0.5m, "كيوي", 1.1m },
                    { 106, 65m, 17m, 2, 0.3m, "مانجو", 0.5m },
                    { 107, 68m, 14.3m, 2, 0m, "جوافة", 2.5m },
                    { 108, 69m, 18.1m, 2, 0.2m, "عنب", 0.7m },
                    { 109, 77m, 15.4m, 2, 0.1m, "بطاطس (بعد الطهي)", 2.1m },
                    { 110, 78m, 13m, 2, 0.77m, "ذرة حلوة (حدائق كاليفورنيا)", 3m },
                    { 111, 83m, 15.55m, 2, 0.22m, "بسلة (بعد الطهي)", 5.33m },
                    { 112, 83m, 18.7m, 2, 0.2m, "برغل (بعد الطهي)", 3.1m },
                    { 113, 83m, 18.7m, 2, 1.2m, "رمان", 1.7m },
                    { 114, 86m, 17.1m, 2, 0.1m, "بطاطا (فبل الطهي)", 1.6m },
                    { 115, 87m, 10m, 2, 0m, "مربي لايت (زيرو تريت)", 11.5m },
                    { 116, 89m, 21.3m, 2, 0.3m, "موز", 0.7m },
                    { 117, 92m, 16m, 2, 0m, "فاصوليا بيضاء", 6.1m },
                    { 118, 94m, 13m, 2, 2.8m, "فول مدمس", 5.8m },
                    { 119, 98m, 14m, 2, 2.4m, "فاصوليا حمراء", 6m },
                    { 120, 100m, 22m, 2, 1.5m, "ذرة", 3.5m },
                    { 121, 106m, 12.29m, 2, 3m, "زبادي يوناني بالفواكه (جهينة)", 7.33m },
                    { 122, 112m, 26.46m, 2, 0.2m, "قلقاس (بعد الطهي)", 1.5m },
                    { 123, 116m, 20.8m, 2, 0.5m, "لوبيا (بعد الطبخ)", 7.7m },
                    { 124, 116.5m, 20m, 2, 0.4m, "فول مدمس مطبوخ", 8m },
                    { 125, 119m, 10m, 2, 2.9m, "ترمس (بعد الطهي)", 16m },
                    { 126, 120m, 18.5m, 2, 1.9m, "كينوا", 4.4m },
                    { 127, 123m, 26m, 2, 0.4m, "أرز (بعد الطهي)", 2.9m },
                    { 128, 124m, 26m, 2, 1m, "أرز بني (بعد الطهي)", 3m },
                    { 129, 131m, 25m, 2, 1.1m, "مكرونة شوفان (بعد الطهي)", 5m },
                    { 130, 140m, 23m, 2, 0.5m, "عدس (بعد الطهي)", 12m },
                    { 131, 149m, 26.2m, 2, 1.7m, "مكرونة (بعد الطهي)", 6m },
                    { 132, 154m, 15m, 2, 1m, "قطع دجاج نباتي (Not Fried)", 19m },
                    { 133, 164m, 19.7m, 2, 2.6m, "حمص ( مسلوق بدون ملح)", 8.9m },
                    { 134, 175m, 10m, 2, 9.1m, "فول صويا (بعد الطهي)", 16.5m },
                    { 135, 175m, 29.3m, 2, 2.7m, "حمص (بعد الطهي)", 9.8m },
                    { 136, 214m, 35m, 2, 2m, "طعمية مصرية (Not Fried)", 15m },
                    { 137, 236.8m, 44.1m, 2, 2.9m, "توست بني", 8.7m },
                    { 138, 247m, 65m, 2, 0.4m, "لبان بدون سكر (ترايدنت)", 0.5m },
                    { 139, 260m, 56m, 2, 0.8m, "عيش بلدي", 8m },
                    { 140, 265m, 48.3m, 2, 3.2m, "عيش أسمر", 10.7m },
                    { 141, 275m, 47.5m, 2, 3.4m, "خبز الشعير", 9m },
                    { 142, 282m, 75m, 2, 0.4m, "بلح (تمر)", 2.5m },
                    { 143, 289m, 56m, 2, 1.8m, "عيش فرنسي (باجيت)", 12m },
                    { 144, 290m, 75m, 2, 0m, "عسل أسود", 0m },
                    { 145, 299m, 74.3m, 2, 0.3m, "زبيب", 3.3m },
                    { 146, 300m, 57.5m, 2, 4m, "عيش (Honey&Dough)", 10m },
                    { 147, 325m, 70m, 2, 2.5m, "فريك", 15m },
                    { 148, 340m, 72m, 2, 2.5m, "دقيق أبيض (كامل الحبة)", 13.2m },
                    { 149, 357m, 85.7m, 2, 0.9m, "رقائق ذرة (كيلوجز)", 7.1m },
                    { 150, 379m, 67.7m, 2, 6.5m, "شوفان (كامل الحبة)", 13.2m },
                    { 151, 379m, 67.7m, 2, 6.5m, "دقيق شوفان (كامل الحبة)", 13.2m },
                    { 152, 383m, 75m, 2, 4m, "رقائق أفطار (نسكويك)", 7.7m },
                    { 153, 387m, 81.5m, 2, 2.8m, "كعك أرز", 8.2m },
                    { 154, 387m, 78m, 2, 4.5m, "فشار (ذرة بعد التحضير)", 13m },
                    { 155, 387m, 100m, 2, 0m, "سكر أبيض", 0m },
                    { 156, 415m, 78.5m, 2, 9.8m, "مقرمشات قرفة", 6.3m },
                    { 157, 450m, 44m, 2, 17m, "جرانولا (ليزي)", 27m },
                    { 158, 460m, 61m, 2, 18m, "جرانولا بالعسل و المكسرات (سانتي)", 9.8m },
                    { 159, 598m, 22m, 2, 51m, "زبدة فول سوداني بالشيكولاتة (أبوعوف)", 22m },
                    { 160, 833m, 0m, 2, 93.3m, "زيت جوز هند", 0m },
                    { 161, 14300m, 100m, 2, 340m, "كريمة الأرز (Bulk)", 3010m },
                    { 162, 1m, 0m, 2, 0m, "قهوة", 0.1m },
                    { 163, 69.8m, 15.4m, 2, 0.1m, "كريمة الأرز", 1.2m },
                    { 164, 195m, 45.6m, 2, 7.6m, "عيش شوفان (ريف)", 10.5m },
                    { 165, 245m, 30m, 2, 1.3m, "عيش شعير (ريف)", 11.3m },
                    { 166, 247m, 27.6m, 2, 1.2m, "قرفة بودره", 4m },
                    { 167, 266m, 46.7m, 2, 3.3m, "توست أبيض", 8.8m },
                    { 168, 304m, 81.8m, 2, 0m, "عسل", 0.3m },
                    { 169, 371m, 74.6m, 2, 1.5m, "سريس ماس (Optimum)", 14.6m },
                    { 170, 463m, 48m, 2, 26m, "نيسكافية 2*1", 5m },
                    { 171, 18m, 0.4m, 3, 1.9m, "لبن جوزهند", 0.2m },
                    { 172, 160m, 8.5m, 3, 14.7m, "أفوكادو", 2m },
                    { 173, 219m, 0m, 3, 18.8m, "Pilaros, Green Olives Stuffed with Almonds", 3.1m },
                    { 174, 230m, 3m, 3, 22m, "لبنة كريمي (كيري)", 5.5m },
                    { 175, 265m, 3m, 3, 27m, "كريمة طهي (جهينة)", 2.5m },
                    { 176, 354m, 12.5m, 3, 33.75m, "جوز هند (بودرة)", 3.75m },
                    { 177, 387m, 56.3m, 3, 9m, "كاكاو خام (دريم)", 20.3m },
                    { 178, 400m, 16.3m, 3, 35.3m, "هيلثي سبريد", 3.3m },
                    { 179, 446m, 54m, 3, 19m, "لب أبيض", 19m },
                    { 180, 486m, 42.1m, 3, 30.7m, "بذور الشيا", 16.5m },
                    { 181, 553m, 30.2m, 3, 43.9m, "كاجو", 18.2m },
                    { 182, 562m, 28m, 3, 45m, "فستق", 20m },
                    { 183, 575m, 21.7m, 3, 49.4m, "لوز", 21.1m },
                    { 184, 585m, 21.5m, 3, 49.7m, "سوداني", 23.7m },
                    { 185, 598m, 22.5m, 3, 50m, "زبدة فول سوداني", 22.5m },
                    { 186, 607.6m, 35.34m, 3, 43.4m, "شوكولاتة دارك (70-80% كاكاو)", 8.06m },
                    { 187, 614m, 19m, 3, 56m, "زبدة لوز", 21m },
                    { 188, 650m, 14m, 3, 65m, "عين جمل", 15.5m },
                    { 189, 690m, 14m, 3, 72m, "بيكان", 9m },
                    { 190, 717m, 0.1m, 3, 81m, "زبدة", 0.9m },
                    { 191, 850m, 0m, 3, 89.5m, "سمنة بلدي", 0.4m },
                    { 192, 884m, 0m, 3, 100m, "زيت زيتون", 0m }
                });

            migrationBuilder.CreateIndex(
                name: "IX_Foods_CategoryId",
                table: "Foods",
                column: "CategoryId");
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "Foods");

            migrationBuilder.DropTable(
                name: "FoodCategories");
        }
    }
}
